app/Http/Controllers/PresenceController.php

    public function index()
    {
        $attendances = Attendance::all()->sortByDesc('data.is_end')->sortByDesc('data.is_start');
---
select * from `attendances`