app/Models/Attendance.php

select exists(select * from `holidays` where `holiday_date` = '2025-09-30') as `exists`
---
    protected function data(): Attribute
    {
        return Attribute::make(
            get: function ($value) {
                $now = now();
                $hari_ini = strtolower($now->locale('id')->dayName);
                $isWorkDay = in_array($hari_ini, $this->days);

                $isHolidayToday = Holiday::query()
                    ->where('holiday_date', $now->toDateString())
                    ->exists();